#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.resourcegroup will be created
  + resource "azurerm_resource_group" "resourcegroup" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "poc-rg"
      + tags     = {
          + "Maintained-By" = "terraform"
        }
    }

  # azurerm_user_assigned_identity.aks will be created
  + resource "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "poc-identity-aks"
      + principal_id        = (known after apply)
      + resource_group_name = "poc-rg"
      + tags                = {
          + "Maintained-By" = "terraform"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.app_gateway will be created
  + resource "azurerm_user_assigned_identity" "app_gateway" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "poc-identity-app-gateway"
      + principal_id        = (known after apply)
      + resource_group_name = "poc-rg"
      + tags                = {
          + "Maintained-By" = "terraform"
        }
      + tenant_id           = (known after apply)
    }

  # module.aks_cluster.data.azurerm_user_assigned_identity.aks_ingress_application_gateway will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "aks_ingress_application_gateway" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = (known after apply)
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.aks_cluster.data.azurerm_user_assigned_identity.application_gateway will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "application_gateway" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "poc-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.aks_cluster.azurerm_kubernetes_cluster.aks_cluster will be created
  + resource "azurerm_kubernetes_cluster" "aks_cluster" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "aks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "poc-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "Created-By-Submodule" = "azure-kubernetes-cluster"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_DS2_v2"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + identity_ids = (sensitive value)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_id                           = (known after apply)
          + ingress_application_gateway_identity = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = "10.254.0.10"
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.254.0.0/17"
          + service_cidrs      = (known after apply)
        }
    }

  # module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignement_operator will be created
  + resource "azurerm_role_assignment" "aks_app_gateway_rg_role_assignement_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_contributor will be created
  + resource "azurerm_role_assignment" "aks_app_gateway_rg_role_assignment_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_reader will be created
  + resource "azurerm_role_assignment" "aks_app_gateway_rg_role_assignment_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_role_assignment.subnet_kubernetes_node_pool_default_role_assignment will be created
  + resource "azurerm_role_assignment" "subnet_kubernetes_node_pool_default_role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_subnet.kubernetes_node_pool_default will be created
  + resource "azurerm_subnet" "kubernetes_node_pool_default" {
      + address_prefixes                               = [
          + "10.0.5.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dev-kubernetes-nodepool-default"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "poc-rg"
      + virtual_network_name                           = "poc-network"
    }

  # module.application_gateway.azurerm_application_gateway.app_gateway will be created
  + resource "azurerm_application_gateway" "app_gateway" {
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = "poc-ag"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "poc-rg"
      + tags                        = {
          + "Maintained-By" = "terraform"
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "poc-ag-beap"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "default-http-backend-settings"
          + path                                = "/"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "ag-frontend-ip-config"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "ag-frontend-port-http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "ag-frontend-port-https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "poc-ag-gateway_ip_config"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "ag-frontend-ip-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "ag-frontend-port-http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "default-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "poc-ag-beap"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "default-http-backend-settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "default-http-listener"
          + id                         = (known after apply)
          + name                       = "default-http-req-routing-rule"
          + priority                   = 20000
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + capacity = 2
          + name     = "Standard_v2"
          + tier     = "Standard_v2"
        }
    }

  # module.application_gateway.azurerm_public_ip.ag_public_ip will be created
  + resource "azurerm_public_ip" "ag_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "poc-ag-public_ip"
      + resource_group_name     = "poc-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Maintained-By" = "terraform"
        }
    }

  # module.virtual_network.azurerm_subnet.frontend will be created
  + resource "azurerm_subnet" "frontend" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "frontend-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "poc-rg"
      + virtual_network_name                           = "poc-network"
    }

  # module.virtual_network.azurerm_virtual_network.base_network will be created
  + resource "azurerm_virtual_network" "base_network" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "poc-network"
      + resource_group_name = "poc-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Maintained-By" = "terraform"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aks_cluster_id   = (known after apply)
  + aks_cluster_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dtags, Action: `pull_request`*